---
type: ElectricalLoadClassification
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 14
tags: [revit-api, class]
---

# ElectricalLoadClassification

`Autodesk.Revit.DB.Electrical.ElectricalLoadClassification` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2011 | `public static ElectricalLoadClassification Create ( Document ADoc , string strName )` |
| Property | Abbreviation | 2021 | `public string Abbreviation { get ; set ; }` |
| Property | ActualElectricalLoadLabel | 2014 | `public string ActualElectricalLoadLabel { get ; set ; }` |
| Property | DemandFactorId | 2011 | `public ElementId DemandFactorId { get ; set ; }` |
| Property | LoadSummaryDemandFactorLabel | 2014 | `public string LoadSummaryDemandFactorLabel { get ; set ; }` |
| Property | Motor | 2011 | `public bool Motor { get ; }` |
| Property | Other | 2024 | `public bool Other { get ; }` |
| Property | PanelConnectedCurrentLabel | 2014 | `public string PanelConnectedCurrentLabel { get ; set ; }` |
| Property | PanelConnectedLabel | 2014 | `public string PanelConnectedLabel { get ; set ; }` |
| Property | PanelEstimatedCurrentLabel | 2014 | `public string PanelEstimatedCurrentLabel { get ; set ; }` |
| Property | PanelEstimatedLabel | 2014 | `public string PanelEstimatedLabel { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SpaceLoadClass | 2011 | `public ElectricalLoadClassificationSpace SpaceLoadClass { get ; set ; }` |
| Property | Spare | 2023 | `public bool Spare { get ; }` |